In [1]:
import pandas as pd
data = pd.read_csv('clustering_analysis.csv')

In [2]:
data.head()

,Unnamed: 0,ride_id,seat_number,travel_from,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa,new_time_frame
0,0,1442,0,371,1,435,1,0,0,1,365
1,1,5437,0,371,1,432,1,0,0,1,334
2,2,5710,0,280,1,425,1,0,0,1,334
3,3,5777,0,363,1,430,1,0,0,1,334
4,4,5778,0,371,1,432,1,0,0,1,334

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 11 columns):
Unnamed: 0                51645 non-null int64
ride_id                   51645 non-null int64
seat_number               51645 non-null int64
travel_from               51645 non-null int64
max_capacity              51645 non-null int64
travel_time_in_seconds    51645 non-null int64
car_type_Bus              51645 non-null int64
car_type_shuttle          51645 non-null int64
payment_method_Cash       51645 non-null int64
payment_method_Mpesa      51645 non-null int64
new_time_frame            51645 non-null int64
dtypes: int64(11)
memory usage: 4.3 MB

In [6]:
data = data.drop('Unnamed: 0', axis = 1)